rename the agent steps
Signed-off-by: Niels Bantilan <niels.bantilan@gmail.com>
